In [35]:
import pandas as pd
import numpy as np
index = pd.date_range('1/1/2000', periods=8)
print(index)

##uses index from above to create df frame
df = pd.DataFrame(np.random.randn(8, 3), index=index,
                  columns=['A', 'B', 'C'])

print(df.shape)
##example of manipulating columns
##takes the lower case of the column labels
df.columns = [x.lower() for x in df.columns]
print(df)

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')
(8, 3)
                   a         b         c
2000-01-01  1.146426  0.379465  0.841864
2000-01-02 -0.925177  1.197975 -0.105077
2000-01-03  0.414974  0.269393  2.200447
2000-01-04 -0.953794  0.156636  0.041663
2000-01-05  2.094928  0.611508  1.096490
2000-01-06  0.395256  0.317347  1.386906
2000-01-07 -1.713387 -0.122442  1.347934
2000-01-08 -1.755563 -0.992842  1.381642

In [36]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
print(s)

#get the underlying array from the dataframe
print(np.asarray(s))

a    0.425896
b   -0.053549
c    1.090100
d    0.273393
e    1.538543
dtype: float64
[ 0.42589561 -0.0535487   1.09009974  0.27339274  1.53854259]

In [37]:
print(df)

                   a         b         c
2000-01-01  1.146426  0.379465  0.841864
2000-01-02 -0.925177  1.197975 -0.105077
2000-01-03  0.414974  0.269393  2.200447
2000-01-04 -0.953794  0.156636  0.041663
2000-01-05  2.094928  0.611508  1.096490
2000-01-06  0.395256  0.317347  1.386906
2000-01-07 -1.713387 -0.122442  1.347934
2000-01-08 -1.755563 -0.992842  1.381642

In [87]:
##broadcasting
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [90]:
#use index to select a particular row
df.loc['a']

one     -1.136283
two     -0.194991
three         NaN
Name: a, dtype: float64

In [81]:
#grab a row and subtract
row = df.iloc[1]
df.sub(row, axis='columns')
#grab a column and subtract
column = df['two']
df.sub(column, axis='rows')

        one  two     three
a -2.495928  0.0       NaN
b  1.204596  0.0 -0.633319
c -1.591814  0.0 -2.079551
d       NaN  0.0 -0.717619

In [39]:
##align a multiindexed array with a series

dfmi = df.copy()
dfmi.index = pd.MultiIndex.from_tuples([(1, 'a'), (1, 'b'),
                                        (1, 'c'), (2, 'a')],
                                        names=['first', 'second'])
dfmi

#dfmi.sub(column, axis=0, level='second')

                   one       two     three
first second
1     a       0.483250 -0.094634       NaN
      b       0.348504  0.837762 -0.719667
      c      -0.245495 -1.240634  0.724072
2     a            NaN -0.311440  0.903049

In [40]:
##pandas creates a series from a dictionary; the keys are the indices
d = {'Chicago': 1000, 'New York': 1300, 'Portland': 900, 'San Francisco': 1100,
     'Austin': 450, 'Boston': None}
cities = pd.Series(d)
cities
cities['Austin']
cities[cities>200]

#replace values
cities[cities>200] = 5000
cities

Chicago          5000.0
New York         5000.0
Portland         5000.0
San Francisco    5000.0
Austin           5000.0
Boston              NaN
dtype: float64

In [41]:
print('San Francisco' in cities)

True

In [42]:

cities/3
np.square(cities)

Chicago          25000000.0
New York         25000000.0
Portland         25000000.0
San Francisco    25000000.0
Austin           25000000.0
Boston                  NaN
dtype: float64

In [43]:
##add two series together; only adds where indices match

print(cities[['Chicago', 'New York', 'Portland']])
print('\n')
print(cities[['Austin', 'New York']])
print('\n')
print(cities[['Chicago', 'New York', 'Portland']] + cities[['Austin', 'New York']])

Chicago     5000.0
New York    5000.0
Portland    5000.0
dtype: float64


Austin      5000.0
New York    5000.0
dtype: float64


Austin          NaN
Chicago         NaN
New York    10000.0
Portland        NaN
dtype: float64

In [44]:
data = {'year': [2010, 2011, 2012, 2011, 2012, 2010, 2011, 2012],
        'team': ['Bears', 'Bears', 'Bears', 'Packers', 'Packers', 'Lions', 'Lions', 'Lions'],
        'wins': [11, 8, 10, 15, 11, 6, 10, 4],
        'losses': [5, 8, 6, 1, 5, 10, 6, 12]}
football = pd.DataFrame(data, columns=['year', 'team', 'wins', 'losses'])
football

   year     team  wins  losses
0  2010    Bears    11       5
1  2011    Bears     8       8
2  2012    Bears    10       6
3  2011  Packers    15       1
4  2012  Packers    11       5
5  2010    Lions     6      10
6  2011    Lions    10       6
7  2012    Lions     4      12

In [45]:
##read directly from sql
from pandas.io import sql
import sqlite3

conn = sqlite3.connect('/Users/gjreda/Dropbox/gregreda.com/_code/towed')
query = "SELECT * FROM towed WHERE make = 'FORD';"

results = sql.read_sql(query, con=conn)
results.head()

OperationalError: unable to open database file

In [46]:
dates = pd.date_range('1/1/2000', periods=8)
#use dates as the index below
df = pd.DataFrame(np.random.randn(8, 4),
                  index=dates, columns=['A', 'B', 'C', 'D'])

In [47]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [48]:
dates[5]

Timestamp('2000-01-06 00:00:00', freq='D')

In [51]:
s = df['A']

In [52]:
s[dates[5]]

-0.5713506069513642

In [67]:
df['A'] = 2
#df.new = 6
df['B'] = 'A'

df

In [71]:
#create a df from python dict
x = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5]})
#use iloc to set a row
x.iloc[1] = {'x': 9, 'y': 99}

   x  y
0  1  3
1  2  4
2  3  5

In [72]:
#get first three rows of df
df[:3]

            A  B         C         D  new
2000-01-01  2  A  1.007400  0.110703    2
2000-01-02  2  A -0.328411  0.925719    2
2000-01-03  2  A -1.040557  0.628333    2

In [ ]:
##using a callable
df1 = pd.DataFrame(np.random.randn(6, 4),
                   index=list('abcdef'),
                   columns=list('ABCD'))

In [75]:
left_frame = pd.DataFrame({'key': range(5), 
                           'left_value': ['a', 'b', 'c', 'd', 'e']})
right_frame = pd.DataFrame({'key': range(2, 7), 
                           'right_value': ['f', 'g', 'h', 'i', 'j']})
print(left_frame)
print('\n')
print(right_frame)
##inner join (default) only keep common
##other joins are left, right, outer..left keeps all left and puts nan in non matching right
##outer keeps all matching and non matching
pd.merge(left_frame, right_frame, on='key', how='inner')

   key left_value
0    0          a
1    1          b
2    2          c
3    3          d
4    4          e


   key right_value
0    2           f
1    3           g
2    4           h
3    5           i
4    6           j

   key left_value right_value
0    2          c           f
1    3          d           g
2    4          e           h

In [ ]:
import pandas as pd
import numpy as np

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

grouped = df.groupby('Year')
print grouped['Points'].agg(np.mean)